<!-- 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». -->

<?php
    $regions = [
        'Московская область' => [
            "Москва", "Зеленоград", "Клин"
        ],
        'Ленинградская область' => [
            "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
        ],
        'Рязанская область' => [
            "Рязань", "Михайлов", "	Рыбное"
        ]
    ];

    foreach($regions as $region => $cities) {
        $kcities = [];
        foreach($cities as $city) {
            if (mb_substr($city, 0, 1, "UTF-8") === "К") {
                array_push($kcities, $city);
            }
        }
        $str = $kcities ? implode(", ", $kcities) : "Нет городов на букву К";
        echo "$region<br>$str<br>";
    }
?>